//
//  Tz.swift
//  AlefDevelopmentTest
//
//  Created by Женя  on 9.03.22.
//

import Foundation
/*
 Здравствуйте!
  
 Спасибо, что вы проявили интерес к вакансии iOS-разработчик в компании Alef Development.
  
 Мы предлагаем вам выполнить тестовое задание.
  
 Разработайте экран, где человек может заполнить информацию о себе и своих детях.
 Сверху должны быть поля ввода ФИО и возраста пользователя.
  
 Ниже должна вводится информация о детях. Изначально пользователь видит только кнопку "+", при нажатии на нее появляется блок в котором можно ввести информацию о ребенке: Имя и возраст. Таким образом пользователь может добавить вплоть до 5 детей. Когда пользователь добавил 5 детей — кнопка "+" исчезает и больше недоступна.
  
 Так же напротив каждого ребенка есть кнопка "удалить" , при нажатии на которую соответствующая запись удаляется.
  
 Внизу экрана расположена кнопка "Очистить". При нажатии на нее появляется ActionSheet с двумя кнопками "Сбросить данные" и "Отмена". При нажатии на кнопку "Сбросить данные", все данные, введенные на этой странице сбрасываются (в том числе удаляются все дети) и ActionSheet закрывается. При нажатии на кнопку "Отмена" ActionSheet закрывается и сброса данных не происходит.

 Интерфейс должен быть разработан на UIKit (не SwiftUI).
  
 Готовое тестовое задание пришлите ответным письмом с темой: Тестовое задание iOS. Кандидат <ваши имя и фамилия>.
  
 При выполнении задания точность до пикселя не важна, но нужно выдержать общий стиль.
 */
